package oop_itvdn.eighth_lesson.price;

//Задание 3
//Создайте проект, используя IntelliJ IDEA.
//Требуется: Описать класс с именем Price, содержащую следующие поля:
// название товара;
// название магазина, в котором продается товар;
// стоимость товара в гривнах.
//Написать программу, выполняющую следующие действия:
// ввод с клавиатуры данных в массив, состоящий из двух элементов типа Price (записи должны
//быть упорядочены в алфавитном порядке по названиям магазинов);

public class Price {
}
