package oop_itvdn.eighth_lesson.worker;

//Задание 2
//Создайте проект, используя IntelliJ IDEA.
//Требуется:
//Описать класс с именем Worker, содержащую следующие поля:
// фамилия и инициалы работника;
// название занимаемой должности;
// год поступления на работу.
//Написать программу, выполняющую следующие действия:
// ввод с клавиатуры данных в массив, состоящий из пяти элементов типа Worker (записи должны
//быть упорядочены по алфавиту); TODO: хочу зробити два рішення 1)впорядкуавння по алфавіту після створення масиву екземплярів
// если значение года введено  TODO:2) під час створення екземплярів вони вже будуть поміщатися в масив на потрібне місце
// не в соответствующем формате выдает исключение.
// вывод на экран фамилии работника, стаж работы которого превышает введенное значение.

public class Worker {
}
